IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART2_UART2.xml
	<register id="UART2_IIR_UART" acronym="UART2_IIR_UART" offset="0x8" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="FCR_MIRROR" width="2" begin="7" end="6" resetval="0x0" description="Mirror the contents of FCR[0] on both bits." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="IT_TYPE" width="5" begin="5" end="1" resetval="0x0" description="Not Defined    Read0x00   |   IT_TYPE_VALUE_0Modem Interrupt. Priority=4      Read0x01   |   IT_TYPE_VALUE_1THR interrupt.  Priority=3      Read0x02   |   IT_TYPE_VALUE_2RHR interrupt.  Priority=2      Read0x03   |   IT_TYPE_VALUE_3Receiver line status error.  Priority=3      Read0x06   |   IT_TYPE_VALUE_6Rx timeout.  Priority=2      Read0x08   |   IT_TYPE_VALUE_8Xoff/Special character.  Priority=5      Read0x10   |   IT_TYPE_VALUE_10CTS, RTS, DSR change state from active (low) to inactive (high). Priority=6  " range="5 - 1" rwaccess="RO"/> 
		<bitfield id="IT_PENDING" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   IT_PENDING_VALUE_0An interrupt is pending      Read1   |   IT_PENDING_VALUE_1No interrupt is pending  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART2_LCR" acronym="UART2_LCR" offset="0xC" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DIV_EN" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   DIV_EN_VALUE_0Normal operating condition      1   |   DIV_EN_VALUE_1Divisor latch enable. Allows to access to DLL, DLH and other registers (refer to the registers mapping)  " range="7" rwaccess="RW"/> 
		<bitfield id="BREAK_EN" width="1" begin="6" end="6" resetval="0x0" description="Break control bit.    0   |   BREAK_EN_VALUE_0Normal operating condition.      1   |   BREAK_EN_VALUE_1Forces the transmitter output to go low to alert the communication terminal  " range="6" rwaccess="RW"/> 
		<bitfield id="PARITY_TYPE2" width="1" begin="5" end="5" resetval="0x0" description="Selects the forced parity format [if LCR[3] = 1]. If LCR[5] = 1 and LCR[4] = 0, the parity bit is forced to 1 in the transmitted and received data. If LCR[5] = 1 and LCR[4] = 1, the parity bit is forced to 0 in the transmitted and received data." range="5" rwaccess="RW"/> 
		<bitfield id="PARITY_TYPE1" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   PARITY_TYPE1_VALUE_0Odd parity is generated (if LCR[3] = 1)      1   |   PARITY_TYPE1_VALUE_1Even parity is generated (if LCR[3] = 1)  " range="4" rwaccess="RW"/> 
		<bitfield id="PARITY_EN" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   PARITY_EN_VALUE_0No parity      1   |   PARITY_EN_VALUE_1A parity bit is generated during transmission and the receiver checks for received parity.  " range="3" rwaccess="RW"/> 
		<bitfield id="NB_STOP" width="1" begin="2" end="2" resetval="0x0" description="Specifies the number of stop bits:    0   |   NB_STOP_VALUE_01 stop bits (word length = 5, 6, 7, 8)      1   |   NB_STOP_VALUE_11.5 stop bits (word length = 5) in USART mode. 2 stop bits (word length = 6, 7, 8)  " range="2" rwaccess="RW"/> 
		<bitfield id="CHAR_LENGTH" width="2" begin="1" end="0" resetval="0x0" description="Specifies the word length to be transmitted or received.    0x0   |   CHAR_LENGTH_VALUE_05 bits      0x1   |   CHAR_LENGTH_VALUE_16 bits      0x2   |   CHAR_LENGTH_VALUE_27 bits      0x3   |   CHAR_LENGTH_VALUE_38 bits  " range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="UART2_XON1_ADDR1" acronym="UART2_XON1_ADDR1" offset="0x10" width="8" description="">
		<bitfield id="XON_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON1 character in UART modes and ADDR1 address 1 for IrDA modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART2_MCR" acronym="UART2_MCR" offset="0x10" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Not Defined" range="7" rwaccess="RO"/> 
		<bitfield id="TCR_TLR" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   TCR_TLR_VALUE_0No action      1   |   TCR_TLR_VALUE_1Enables access to the TCR and TLR registers.  " range="6" rwaccess="RW"/> 
		<bitfield id="XON_EN" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   XON_EN_VALUE_0Disable 'XON any' function      1   |   XON_EN_VALUE_1Enable 'XON any' function  " range="5" rwaccess="RW"/> 
		<bitfield id="LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   LOOPBACK_EN_VALUE_0Normal operating mode      1   |   LOOPBACK_EN_VALUE_1Enable local loopback mode (internal). In this mode the MCR[3:0] signals are looped back into MSR[7:4]. The transmit output is looped back to the receive input internally  " range="4" rwaccess="RW"/> 
		<bitfield id="CD_STS_CH" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   CD_STS_CH_VALUE_0In loopback forces DCD* input high and IRQ outputs to inactive state.      1   |   CD_STS_CH_VALUE_1In loopback forces DCD* input low and IRQ outputs to inactive state.  " range="3" rwaccess="RW"/> 
		<bitfield id="RI_STS_CH" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RI_STS_CH_VALUE_0In loopback forces RI* input high.      1   |   RI_STS_CH_VALUE_1In loopback forces RI* input low.  " range="2" rwaccess="RW"/> 
		<bitfield id="RTS" width="1" begin="1" end="1" resetval="0x0" description="In loop back controls MSR[4].If auto-RTS is enabled the RTS* output is controlled by hardware flow control.    0   |   RTS_VALUE_0Force RTS* output to inactive (high).      1   |   RTS_VALUE_1Force RTS* output to active (low).  " range="1" rwaccess="RW"/> 
		<bitfield id="DTR" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   DTR_VALUE_0Force DTR* output to inactive (high).      1   |   DTR_VALUE_1Force DTR* output to active (low).  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART2_XON2_ADDR2" acronym="UART2_XON2_ADDR2" offset="0x14" width="8" description="">
		<bitfield id="XON_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON2 character in UART modes and ADDR2 address 2 for IrDA modes." range="7 - 0" rwaccess="RW"/>
	</register>
